// Что такое анонимные функции и лямбда-функции в JS

// Если после function есть имя — функция именованная, во всех остальных случая анонимная
// - можно передавать как аргумент в другую функцию;
// - можно сохранять в переменную;
// - можно вызывать на месте;
// - стрелочные функции в JS всегда анонимны.
// хорошая статья на тему https://medium.com/devschacht/anonymous-functions-in-javascript-ff6b9ba85de0

// Лямбда-функции:
// - не имеет имени;
// - может принимать только один аргумент;
// - нужна для связывания переменных;
// - может передаваться как аргумент в другую функцию или возвращаться из функции в качестве результата вычисления;
// - не может влиять на внешний мир (без сайд-эффектов).
// хорошая статья на тему http://andreymiskov.ru/posts/anonymous-functions-and-lambdas/
